4ms/metamodule/firmware/lib/cmsis-device/stm32mp157c/include/stm32mp157cxx_ca7_periphaddrs.h
/** @addtogroup Peripheral_memory_map
 * @{
 */
#define AHB_SRAM                                                                                                       \
	((uint32_t)0x30000000) /*!< Base address of : (up to 288KB) system data RAM accessible over over AHB */
#define AHB_RETRAM                                                                                                     \
	((uint32_t)0x38000000) /*!< Base address of : (up to 64KB) Retention RAM accessible over over AHB */

#define SYSRAM_BASE                                                                                                    \
	((uint32_t)0x2FFC0000) /*!< Base address of : (up to 256KB) System RAM accessible over over AXI */
#define RETRAM_BASE MCU_AHB_RETRAM
#define SRAM_BASE AHB_SRAM
#define PERIPH_BASE                                                                                                    \
	((uint32_t)0x40000000) /*!< Base address of : AHB/ABP Peripherals */
#define AXI_BUS_MEMORY_BASE                                                                                            \
	((uint32_t)0x60000000) /*!< Base address of : AXI Bus */

#define FMC_NOR_MEM_BASE                                                                                               \
	(AXI_BUS_MEMORY_BASE) /*!< Base address of : FMC NOR memories  accessible over AXI              */
#define QSPI_MEM_BASE                                                                                                  \
	(AXI_BUS_MEMORY_BASE + 0x10000000) /*!< Base address of : QSPI memories  accessible over AXI                 */
#define FMC_NAND_MEM_BASE                                                                                              \
	(AXI_BUS_MEMORY_BASE + 0x20000000) /*!< Base address of : FMC NAND memories  accessible over AXI             */
#define STM_DATA_BASE                                                                                                  \
	(AXI_BUS_MEMORY_BASE + 0x30000000) /*!< Base address of : STM Data accessible over AXI                       */
#define DRAM_MEM_BASE                                                                                                  \
	(AXI_BUS_MEMORY_BASE + 0x60000000) /*!< Base address of : DRAM (DDR) over AXI                                */

/*!< Device electronic signature memory map */
#define UID_BASE (0x5C005234L)	   /*!< Unique Device ID register base address */
#define PACKAGE_BASE (0x5C005240L) /*!< Package Data register base address */
#define RPN_BASE (0x5C005204L)	   /*!< Device Part Number register base address */
#define DV_BASE (0x50081000L)	   /*!< Device Version register base address */

/*!< Peripheral memory map */
#define APB1_PERIPH_BASE (PERIPH_BASE + 0x00000000)
#define APB2_PERIPH_BASE (PERIPH_BASE + 0x04000000)
#define AHB2_PERIPH_BASE (PERIPH_BASE + 0x08000000)
#define AHB3_PERIPH_BASE (PERIPH_BASE + 0x0C000000)
#define AHB4_PERIPH_BASE (PERIPH_BASE + 0x10000000)
#define APB3_PERIPH_BASE (PERIPH_BASE + 0x10020000)
#define APB_DEBUG_PERIPH_BASE (PERIPH_BASE + 0x10080000)
#define AHB5_PERIPH_BASE (PERIPH_BASE + 0x14000000)
#define GPV_PERIPH_BASE (PERIPH_BASE + 0x17000000)
#define AHB6_PERIPH_BASE (PERIPH_BASE + 0x18000000)
#define APB4_PERIPH_BASE (PERIPH_BASE + 0x1A000000)
#define APB5_PERIPH_BASE (PERIPH_BASE + 0x1C000000)

#define MCU_AHB_SRAM AHB_SRAM
#define MCU_AHB_RETRAM AHB_RETRAM
#define MPU_AXI_BUS_MEMORY_BASE AXI_BUS_MEMORY_BASE
#define MCU_APB1_PERIPH_BASE APB1_PERIPH_BASE
#define MCU_APB2_PERIPH_BASE APB2_PERIPH_BASE
#define MCU_AHB2_PERIPH_BASE AHB2_PERIPH_BASE
#define MCU_AHB3_PERIPH_BASE AHB3_PERIPH_BASE
#define MCU_AHB4_PERIPH_BASE AHB4_PERIPH_BASE
#define MCU_APB3_PERIPH_BASE APB3_PERIPH_BASE
#define MPU_AHB5_PERIPH_BASE AHB5_PERIPH_BASE
#define MPU_AHB6_PERIPH_BASE AHB6_PERIPH_BASE
#define MPU_APB4_PERIPH_BASE APB4_PERIPH_BASE
#define MPU_APB5_PERIPH_BASE APB5_PERIPH_BASE

/*!< APB1 */
#define TIM2_BASE (APB1_PERIPH_BASE + 0x0000)
#define TIM3_BASE (APB1_PERIPH_BASE + 0x1000)
#define TIM4_BASE (APB1_PERIPH_BASE + 0x2000)
#define TIM5_BASE (APB1_PERIPH_BASE + 0x3000)
#define TIM6_BASE (APB1_PERIPH_BASE + 0x4000)
#define TIM7_BASE (APB1_PERIPH_BASE + 0x5000)
#define TIM12_BASE (APB1_PERIPH_BASE + 0x6000)
#define TIM13_BASE (APB1_PERIPH_BASE + 0x7000)
#define TIM14_BASE (APB1_PERIPH_BASE + 0x8000)
#define LPTIM1_BASE (APB1_PERIPH_BASE + 0x9000)
#define WWDG1_BASE (APB1_PERIPH_BASE + 0xA000)
#define SPI2_BASE (APB1_PERIPH_BASE + 0xB000)
#define SPI3_BASE (APB1_PERIPH_BASE + 0xC000)
#define SPDIFRX_BASE (APB1_PERIPH_BASE + 0xD000)
#define USART2_BASE (APB1_PERIPH_BASE + 0xE000)
#define USART3_BASE (APB1_PERIPH_BASE + 0xF000)
#define UART4_BASE (APB1_PERIPH_BASE + 0x10000)
#define UART5_BASE (APB1_PERIPH_BASE + 0x11000)
#define I2C1_BASE (APB1_PERIPH_BASE + 0x12000)
#define I2C2_BASE (APB1_PERIPH_BASE + 0x13000)
#define I2C3_BASE (APB1_PERIPH_BASE + 0x14000)
#define I2C5_BASE (APB1_PERIPH_BASE + 0x15000)
#define CEC_BASE (APB1_PERIPH_BASE + 0x16000)
#define DAC1_BASE (APB1_PERIPH_BASE + 0x17000)
#define UART7_BASE (APB1_PERIPH_BASE + 0x18000)
#define UART8_BASE (APB1_PERIPH_BASE + 0x19000)
#define MDIOS_BASE (APB1_PERIPH_BASE + 0x1C000)

/*!< APB2 */
#define TIM1_BASE (APB2_PERIPH_BASE + 0x0000)
#define TIM8_BASE (APB2_PERIPH_BASE + 0x1000)
#define USART6_BASE (APB2_PERIPH_BASE + 0x3000)
#define SPI1_BASE (APB2_PERIPH_BASE + 0x4000)
#define SPI4_BASE (APB2_PERIPH_BASE + 0x5000)
#define TIM15_BASE (APB2_PERIPH_BASE + 0x6000)
#define TIM16_BASE (APB2_PERIPH_BASE + 0x7000)
#define TIM17_BASE (APB2_PERIPH_BASE + 0x8000)
#define SPI5_BASE (APB2_PERIPH_BASE + 0x9000)
#define SAI1_BASE (APB2_PERIPH_BASE + 0xA000)
#define SAI1_Block_A_BASE (SAI1_BASE + 0x004)
#define SAI1_Block_B_BASE (SAI1_BASE + 0x024)
#define SAI2_BASE (APB2_PERIPH_BASE + 0xB000)
#define SAI2_Block_A_BASE (SAI2_BASE + 0x004)
#define SAI2_Block_B_BASE (SAI2_BASE + 0x024)
#define SAI3_BASE (APB2_PERIPH_BASE + 0xC000)
#define SAI3_Block_A_BASE (SAI3_BASE + 0x004)
#define SAI3_Block_B_BASE (SAI3_BASE + 0x024)
#define DFSDM1_BASE (APB2_PERIPH_BASE + 0xD000)
#define DFSDM1_Channel0_BASE (DFSDM1_BASE + 0x00)
#define DFSDM1_Channel1_BASE (DFSDM1_BASE + 0x20)
#define DFSDM1_Channel2_BASE (DFSDM1_BASE + 0x40)
#define DFSDM1_Channel3_BASE (DFSDM1_BASE + 0x60)
#define DFSDM1_Channel4_BASE (DFSDM1_BASE + 0x80)
#define DFSDM1_Channel5_BASE (DFSDM1_BASE + 0xA0)
#define DFSDM1_Channel6_BASE (DFSDM1_BASE + 0xC0)
#define DFSDM1_Channel7_BASE (DFSDM1_BASE + 0xE0)
#define DFSDM1_Filter0_BASE (DFSDM1_BASE + 0x100)
#define DFSDM1_Filter1_BASE (DFSDM1_BASE + 0x180)
#define DFSDM1_Filter2_BASE (DFSDM1_BASE + 0x200)
#define DFSDM1_Filter3_BASE (DFSDM1_BASE + 0x280)
#define DFSDM1_Filter4_BASE (DFSDM1_BASE + 0x300)
#define DFSDM1_Filter5_BASE (DFSDM1_BASE + 0x380)
#define FDCAN1_BASE (APB2_PERIPH_BASE + 0xE000)
#define FDCAN2_BASE (APB2_PERIPH_BASE + 0xF000)
#define TTFDCAN1_BASE (APB2_PERIPH_BASE + 0xE100)
#define FDCAN_CCU_BASE (APB2_PERIPH_BASE + 0x10000)
#define SRAMCAN_BASE (APB2_PERIPH_BASE + 0x11000)

/*!< AHB2 */
#define DMA1_BASE (AHB2_PERIPH_BASE + 0x0000)
#define DMA2_BASE (AHB2_PERIPH_BASE + 0x1000)
#define DMAMUX1_BASE (AHB2_PERIPH_BASE + 0x2000)
#define ADC1_BASE (AHB2_PERIPH_BASE + 0x3000)
#define ADC2_BASE (AHB2_PERIPH_BASE + 0x3100)
#define ADC12_COMMON_BASE (AHB2_PERIPH_BASE + 0x3300)
#define SDMMC3_BASE (AHB2_PERIPH_BASE + 0x4000)
#define DLYB_SDMMC3_BASE (AHB2_PERIPH_BASE + 0x5000)
#define USBOTG_BASE (AHB2_PERIPH_BASE + 0x1000000)

