4ms/metamodule/firmware/lib/cmsis-device/stm32mp157c/include/stm32mp157cxx_ca7_periphaddrs.h
#define HDP ((HDP_TypeDef *)HDP_BASE)

#define BSEC ((BSEC_TypeDef *)BSEC_BASE)

#define CRC2 ((CRC_TypeDef *)CRC2_BASE)
#define CRC1 ((CRC_TypeDef *)CRC1_BASE)

#define GPIOA ((GPIO_TypeDef *)GPIOA_BASE)
#define GPIOB ((GPIO_TypeDef *)GPIOB_BASE)
#define GPIOC ((GPIO_TypeDef *)GPIOC_BASE)
#define GPIOD ((GPIO_TypeDef *)GPIOD_BASE)
#define GPIOE ((GPIO_TypeDef *)GPIOE_BASE)
#define GPIOF ((GPIO_TypeDef *)GPIOF_BASE)
#define GPIOG ((GPIO_TypeDef *)GPIOG_BASE)
#define GPIOH ((GPIO_TypeDef *)GPIOH_BASE)
#define GPIOI ((GPIO_TypeDef *)GPIOI_BASE)
#define GPIOJ ((GPIO_TypeDef *)GPIOJ_BASE)
#define GPIOK ((GPIO_TypeDef *)GPIOK_BASE)
#define ADC1 ((ADC_TypeDef *)ADC1_BASE)
#define ADC2 ((ADC_TypeDef *)ADC2_BASE)
#define ADC12_COMMON ((ADC_Common_TypeDef *)ADC12_COMMON_BASE)

#define IPCC ((IPCC_TypeDef *)IPCC_BASE)
#define IPCC_C1 ((IPCC_CommonTypeDef *)IPCC_BASE)
#define IPCC_C2 ((IPCC_CommonTypeDef *)(IPCC_BASE + 0x10U))
#define CRYP2 ((CRYP_TypeDef *)CRYP2_BASE)
#define CRYP1 ((CRYP_TypeDef *)CRYP1_BASE)
#define HASH2 ((HASH_TypeDef *)HASH2_BASE)
#define HASH1 ((HASH_TypeDef *)HASH1_BASE)
#define HASH2_DIGEST ((HASH_DIGEST_TypeDef *)HASH2_DIGEST_BASE)
#define HASH1_DIGEST ((HASH_DIGEST_TypeDef *)HASH1_DIGEST_BASE)
#define HASH ((HASH_TypeDef *)HASH1)
#define HASH_DIGEST ((HASH_DIGEST_TypeDef *)HASH1_DIGEST)
#define RNG2 ((RNG_TypeDef *)RNG2_BASE)
#define RNG1 ((RNG_TypeDef *)RNG1_BASE)
#define GPIOZ ((GPIO_TypeDef *)GPIOZ_BASE)
#define SDMMC2 ((SDMMC_TypeDef *)SDMMC2_BASE)

#define DLYB_SDMMC1 ((DLYB_TypeDef *)DLYB_SDMMC1_BASE)
#define DLYB_SDMMC2 ((DLYB_TypeDef *)DLYB_SDMMC2_BASE)
#define DLYB_SDMMC3 ((DLYB_TypeDef *)DLYB_SDMMC3_BASE)

#define DMA2 ((DMA_TypeDef *)DMA2_BASE)
#define DMA2_Stream0 ((DMA_Stream_TypeDef *)DMA2_Stream0_BASE)
#define DMA2_Stream1 ((DMA_Stream_TypeDef *)DMA2_Stream1_BASE)
#define DMA2_Stream2 ((DMA_Stream_TypeDef *)DMA2_Stream2_BASE)
#define DMA2_Stream3 ((DMA_Stream_TypeDef *)DMA2_Stream3_BASE)
#define DMA2_Stream4 ((DMA_Stream_TypeDef *)DMA2_Stream4_BASE)
#define DMA2_Stream5 ((DMA_Stream_TypeDef *)DMA2_Stream5_BASE)
#define DMA2_Stream6 ((DMA_Stream_TypeDef *)DMA2_Stream6_BASE)
#define DMA2_Stream7 ((DMA_Stream_TypeDef *)DMA2_Stream7_BASE)

#define DMA1 ((DMA_TypeDef *)DMA1_BASE)
#define DMA1_Stream0 ((DMA_Stream_TypeDef *)DMA1_Stream0_BASE)
#define DMA1_Stream1 ((DMA_Stream_TypeDef *)DMA1_Stream1_BASE)
#define DMA1_Stream2 ((DMA_Stream_TypeDef *)DMA1_Stream2_BASE)
#define DMA1_Stream3 ((DMA_Stream_TypeDef *)DMA1_Stream3_BASE)
#define DMA1_Stream4 ((DMA_Stream_TypeDef *)DMA1_Stream4_BASE)
#define DMA1_Stream5 ((DMA_Stream_TypeDef *)DMA1_Stream5_BASE)
#define DMA1_Stream6 ((DMA_Stream_TypeDef *)DMA1_Stream6_BASE)
#define DMA1_Stream7 ((DMA_Stream_TypeDef *)DMA1_Stream7_BASE)

#define DMAMUX1 ((DMAMUX_Channel_TypeDef *)DMAMUX1_BASE)
#define DMAMUX1_Channel0 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel0_BASE)
#define DMAMUX1_Channel1 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel1_BASE)
#define DMAMUX1_Channel2 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel2_BASE)
#define DMAMUX1_Channel3 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel3_BASE)
#define DMAMUX1_Channel4 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel4_BASE)
#define DMAMUX1_Channel5 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel5_BASE)
#define DMAMUX1_Channel6 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel6_BASE)
#define DMAMUX1_Channel7 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel7_BASE)
#define DMAMUX1_Channel8 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel8_BASE)
#define DMAMUX1_Channel9 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel9_BASE)
#define DMAMUX1_Channel10 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel10_BASE)
#define DMAMUX1_Channel11 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel11_BASE)
#define DMAMUX1_Channel12 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel12_BASE)
#define DMAMUX1_Channel13 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel13_BASE)
#define DMAMUX1_Channel14 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel14_BASE)
#define DMAMUX1_Channel15 ((DMAMUX_Channel_TypeDef *)DMAMUX1_Channel15_BASE)

#define DMAMUX1_RequestGenerator0 ((DMAMUX_RequestGen_TypeDef *)DMAMUX1_RequestGenerator0_BASE)
#define DMAMUX1_RequestGenerator1 ((DMAMUX_RequestGen_TypeDef *)DMAMUX1_RequestGenerator1_BASE)
#define DMAMUX1_RequestGenerator2 ((DMAMUX_RequestGen_TypeDef *)DMAMUX1_RequestGenerator2_BASE)
#define DMAMUX1_RequestGenerator3 ((DMAMUX_RequestGen_TypeDef *)DMAMUX1_RequestGenerator3_BASE)

#define DMAMUX1_ChannelStatus ((DMAMUX_ChannelStatus_TypeDef *)DMAMUX1_ChannelStatus_BASE)
#define DMAMUX1_RequestGenStatus ((DMAMUX_RequestGenStatus_TypeDef *)DMAMUX1_RequestGenStatus_BASE)

#define FMC_Bank1_R ((FMC_Bank1_TypeDef *)FMC_Bank1_R_BASE)
#define FMC_Bank1E_R ((FMC_Bank1E_TypeDef *)FMC_Bank1E_R_BASE)
#define FMC_Bank3_R ((FMC_Bank3_TypeDef *)FMC_Bank3_R_BASE)

#define QUADSPI ((QUADSPI_TypeDef *)QSPI_R_BASE)
#define DLYB_QUADSPI ((DLYB_TypeDef *)DLYB_QSPI_BASE)

#define SDMMC1 ((SDMMC_TypeDef *)SDMMC1_BASE)
#define SDMMC3 ((SDMMC_TypeDef *)SDMMC3_BASE)

#define DBGMCU ((DBGMCU_TypeDef *)DBGMCU_BASE)

#define JPEG ((JPEG_TypeDef *)JPGDEC_BASE)
#define HSEM ((HSEM_TypeDef *)HSEM_BASE)
#define HSEM_COMMON ((HSEM_Common_TypeDef *)(HSEM_BASE + 0x100U))

#define USBPHYC ((USBPHYC_GlobalTypeDef *)USBPHYC_BASE)
#define USBPHYC_PHY1 ((USBPHYC_InstanceTypeDef *)USBPHYC_PHY1_BASE)
#define USBPHYC_PHY2 ((USBPHYC_InstanceTypeDef *)USBPHYC_PHY2_BASE)

#define DDRCTRL ((DDRCTRL_TypeDef *)DDRCTRL_BASE)
#define DDRPERFM ((DDRPERFM_TypeDef *)DDRPERFM_BASE)
#define DDRPHYC ((DDRPHYC_TypeDef *)DDRPHYC_BASE)
#define LTDC ((LTDC_TypeDef *)LTDC_BASE)
#define LTDC_Layer1 ((LTDC_Layer_TypeDef *)LTDC_Layer1_BASE)
#define LTDC_Layer2 ((LTDC_Layer_TypeDef *)LTDC_Layer2_BASE)
#define DSI ((DSI_TypeDef *)DSI_BASE)

#define TZC ((TZC_TypeDef *)TZC_BASE)
#define TZPC ((TZPC_TypeDef *)TZPC_BASE)
#define STGENC ((STGENC_TypeDef *)STGENC_BASE)
#define STGENR ((STGENR_TypeDef *)STGENR_BASE)

#define MDIOS ((MDIOS_TypeDef *)MDIOS_BASE)

#define ETH ((ETH_TypeDef *)ETH_BASE)
#define MDMA ((MDMA_TypeDef *)MDMA_BASE)
#define MDMA_Channel0 ((MDMA_Channel_TypeDef *)MDMA_Channel0_BASE)
#define MDMA_Channel1 ((MDMA_Channel_TypeDef *)MDMA_Channel1_BASE)
#define MDMA_Channel2 ((MDMA_Channel_TypeDef *)MDMA_Channel2_BASE)
#define MDMA_Channel3 ((MDMA_Channel_TypeDef *)MDMA_Channel3_BASE)
#define MDMA_Channel4 ((MDMA_Channel_TypeDef *)MDMA_Channel4_BASE)
#define MDMA_Channel5 ((MDMA_Channel_TypeDef *)MDMA_Channel5_BASE)
#define MDMA_Channel6 ((MDMA_Channel_TypeDef *)MDMA_Channel6_BASE)
#define MDMA_Channel7 ((MDMA_Channel_TypeDef *)MDMA_Channel7_BASE)
#define MDMA_Channel8 ((MDMA_Channel_TypeDef *)MDMA_Channel8_BASE)
#define MDMA_Channel9 ((MDMA_Channel_TypeDef *)MDMA_Channel9_BASE)
#define MDMA_Channel10 ((MDMA_Channel_TypeDef *)MDMA_Channel10_BASE)
#define MDMA_Channel11 ((MDMA_Channel_TypeDef *)MDMA_Channel11_BASE)
#define MDMA_Channel12 ((MDMA_Channel_TypeDef *)MDMA_Channel12_BASE)
#define MDMA_Channel13 ((MDMA_Channel_TypeDef *)MDMA_Channel13_BASE)
#define MDMA_Channel14 ((MDMA_Channel_TypeDef *)MDMA_Channel14_BASE)
#define MDMA_Channel15 ((MDMA_Channel_TypeDef *)MDMA_Channel15_BASE)
#define MDMA_Channel16 ((MDMA_Channel_TypeDef *)MDMA_Channel16_BASE)
#define MDMA_Channel17 ((MDMA_Channel_TypeDef *)MDMA_Channel17_BASE)
#define MDMA_Channel18 ((MDMA_Channel_TypeDef *)MDMA_Channel18_BASE)
#define MDMA_Channel19 ((MDMA_Channel_TypeDef *)MDMA_Channel19_BASE)
#define MDMA_Channel20 ((MDMA_Channel_TypeDef *)MDMA_Channel20_BASE)
#define MDMA_Channel21 ((MDMA_Channel_TypeDef *)MDMA_Channel21_BASE)
#define MDMA_Channel22 ((MDMA_Channel_TypeDef *)MDMA_Channel22_BASE)
#define MDMA_Channel23 ((MDMA_Channel_TypeDef *)MDMA_Channel23_BASE)
#define MDMA_Channel24 ((MDMA_Channel_TypeDef *)MDMA_Channel24_BASE)
#define MDMA_Channel25 ((MDMA_Channel_TypeDef *)MDMA_Channel25_BASE)
#define MDMA_Channel26 ((MDMA_Channel_TypeDef *)MDMA_Channel26_BASE)
#define MDMA_Channel27 ((MDMA_Channel_TypeDef *)MDMA_Channel27_BASE)
#define MDMA_Channel28 ((MDMA_Channel_TypeDef *)MDMA_Channel28_BASE)
#define MDMA_Channel29 ((MDMA_Channel_TypeDef *)MDMA_Channel29_BASE)
#define MDMA_Channel30 ((MDMA_Channel_TypeDef *)MDMA_Channel30_BASE)
#define MDMA_Channel31 ((MDMA_Channel_TypeDef *)MDMA_Channel31_BASE)

#define USB_OTG_HS ((USB_OTG_GlobalTypeDef *)USBOTG_BASE)
/* backward compatibility */
#define USB1_OTG_HS USB_OTG_HS
#define USB2_OTG_FS ((USB_OTG_GlobalTypeDef *)0x00000000)
#define USB_OTG_FS USB2_OTG_FS

#define USB1_EHCI ((USB_EHCI_CapabilityTypeDef *)USB1HSFSP1_BASE)

#define GPU ((GPU_Host_InterfaceTypeDef *)GPU_BASE)

/**
 * @}
 */
